In [1]:
import pandas as pd

In [2]:
import numpy as np

In [6]:
a=pd.Series(["Adi","Aadhar","Ayush"],index=[1,2,3])

In [7]:
a

1       Adi
2    Aadhar
3     Ayush
dtype: object

In [8]:
b=pd.Series(["Dinkar","Yash","Rohit"],index=[4,5,6])

In [9]:
b

4    Dinkar
5      Yash
6     Rohit
dtype: object

In [10]:
pd.concat([a,b])

1       Adi
2    Aadhar
3     Ayush
4    Dinkar
5      Yash
6     Rohit
dtype: object

In [13]:
c={"Name":["Adi","Rohit","Man"],"Age":[12,17,13]}

In [19]:
c1=pd.DataFrame(c)

In [15]:
d={"id":[101,102,103],"city":["Azamgarh","Bhadogi","Varanasi"]}

In [20]:
d1=pd.DataFrame(d)

In [21]:
pd.concat([c1,d1],axis=1)

    Name  Age   id      city
0    Adi   12  101  Azamgarh
1  Rohit   17  102   Bhadogi
2    Man   13  103  Varanasi

In [23]:
m=pd.concat([c1,d1],axis=0)   #wrong way

In [24]:
m

    Name   Age     id      city
0    Adi  12.0    NaN       NaN
1  Rohit  17.0    NaN       NaN
2    Man  13.0    NaN       NaN
0    NaN   NaN  101.0  Azamgarh
1    NaN   NaN  102.0   Bhadogi
2    NaN   NaN  103.0  Varanasi

In [31]:
n=pd.concat([c1,d1],ignore_index=True)        #ignore wala imp hai

In [26]:
n

    Name   Age     id      city
0    Adi  12.0    NaN       NaN
1  Rohit  17.0    NaN       NaN
2    Man  13.0    NaN       NaN
3    NaN   NaN  101.0  Azamgarh
4    NaN   NaN  102.0   Bhadogi
5    NaN   NaN  103.0  Varanasi

In [27]:
m=pd.concat([c1,d1])

In [28]:
m

    Name   Age     id      city
0    Adi  12.0    NaN       NaN
1  Rohit  17.0    NaN       NaN
2    Man  13.0    NaN       NaN
0    NaN   NaN  101.0  Azamgarh
1    NaN   NaN  102.0   Bhadogi
2    NaN   NaN  103.0  Varanasi

In [30]:
m=pd.concat([c1,d1],verify_integrity=True)     #isme error ka mtlb hai ki isme same index repeat ho rhe hai

ValueError: Indexes have overlapping values: Index([0, 1, 2], dtype='int64')

In [32]:
m=pd.concat([c1,d1],keys=['x','y'])

In [33]:
m

      Name   Age     id      city
x 0    Adi  12.0    NaN       NaN
  1  Rohit  17.0    NaN       NaN
  2    Man  13.0    NaN       NaN
y 0    NaN   NaN  101.0  Azamgarh
  1    NaN   NaN  102.0   Bhadogi
  2    NaN   NaN  103.0  Varanasi

In [34]:
df1=pd.DataFrame({"student_id":[101,103,109],"registration_id":["0001","0003","0009"]})
df2=pd.DataFrame({"student_id":[104,107,109],"registration_id":["0004","0007","0009"]})

In [35]:
pd.concat([df1,df2])

   student_id registration_id
0         101            0001
1         103            0003
2         109            0009
0         104            0004
1         107            0007
2         109            0009

In [36]:
pd.concat([df1,df2],ignore_index=True)

   student_id registration_id
0         101            0001
1         103            0003
2         109            0009
3         104            0004
4         107            0007
5         109            0009

In [37]:
pd.concat([df1,df2],ignore_index=True,join='inner')

   student_id registration_id
0         101            0001
1         103            0003
2         109            0009
3         104            0004
4         107            0007
5         109            0009

In [38]:
df1=pd.DataFrame({"student_id":[101,103,109],"registration_id":["0001","0003","0009"]})
df2=pd.DataFrame({"student_id":[104,107,110],"college_id":["0004","0007","0009"]})

In [39]:
pd.concat([df1,df2],ignore_index=True)

   student_id registration_id college_id
0         101            0001        NaN
1         103            0003        NaN
2         109            0009        NaN
3         104             NaN       0004
4         107             NaN       0007
5         110             NaN       0009

In [43]:
pd.concat([df1,df2],ignore_index=True,join='inner')  #jo intersection same hai use dikhayega column wise

   student_id
0         101
1         103
2         109
3         104
4         107
5         110

In [45]:
 pd.concat([df1,df2],ignore_index=True,join='outer') #by default outer hai.

   student_id registration_id college_id
0         101            0001        NaN
1         103            0003        NaN
2         109            0009        NaN
3         104             NaN       0004
4         107             NaN       0007
5         110             NaN       0009

Append method  .................          #not in use in latest version

In [50]:
import pandas as pd

In [55]:
books_df = pd.DataFrame({
    'Title': ['To Kill a Mockingbird', '1984', 'The Great Gatsby'],
    'Author': ['Harper Lee', 'George Orwell', 'F. Scott Fitzgerald']
})

new_book_1 = {'Title': 'The Catcher in the Rye', 'Author': 'J.D. Salinger'}
new_book_2 = {'Title': 'The Hobbit', 'Author': 'J.R.R. Tolkien'}

updated_books_df = books_df.add([new_book_1, new_book_2])

updated_books_df

TypeError: can only concatenate str (not "dict") to str

In [53]:
books_df

                   Title               Author
0  To Kill a Mockingbird           Harper Lee
1                   1984        George Orwell
2       The Great Gatsby  F. Scott Fitzgerald

In [56]:
books_df.append

AttributeError: 'DataFrame' object has no attribute 'append'

one to one
many to one

In [57]:
#same company data in two frame one of them is matching 
#one to one is within each data frame every value is unique

users_df = pd.DataFrame({
    'UserID': [1, 2, 3],
    'UserName': ['Alice', 'Bob', 'Charlie']
})


emails_df = pd.DataFrame({
    'UserID': [2, 3, 1],
    'Email': ['bob@example.com', 'charlie@example.com', 'alice@example.com']
})

In [59]:
pd.merge(users_df,emails_df)

   UserID UserName                Email
0       1    Alice    alice@example.com
1       2      Bob      bob@example.com
2       3  Charlie  charlie@example.com

In [60]:
pd.concat([users_df,emails_df])

   UserID UserName                Email
0       1    Alice                  NaN
1       2      Bob                  NaN
2       3  Charlie                  NaN
0       2      NaN      bob@example.com
1       3      NaN  charlie@example.com
2       1      NaN    alice@example.com

In [61]:
pd.concat([users_df,emails_df],axis=1)

   UserID UserName  UserID                Email
0       1    Alice       2      bob@example.com
1       2      Bob       3  charlie@example.com
2       3  Charlie       1    alice@example.com

#many to one

In [63]:
#lets say any shopping comapny data 

orders_df = pd.DataFrame({
    'OrderID': [101, 102, 103, 104],
    'UserID': [1, 2, 1, 3],  # Note the duplicate UserID values
    'OrderDetail': ['Book', 'Laptop', 'Pen', 'Notebook']
})

users_df = pd.DataFrame({
    'UserID': [1, 2, 3],
    'UserName': ['Alice', 'Bob', 'Charlie']
})

pd.merge(users_df,orders_df)

   UserID UserName  OrderID OrderDetail
0       1    Alice      101        Book
1       1    Alice      103         Pen
2       2      Bob      102      Laptop
3       3  Charlie      104    Notebook

In [64]:
#it is showing that alice has done shopping twice time

In [65]:
user_projects_df = pd.DataFrame({
    'UserID': [1, 2, 1, 3, 2],
    'ProjectID': ['A', 'A', 'B', 'B', 'C']  # Note: Projects A and B involve multiple users
})

project_details_df = pd.DataFrame({
    'ProjectID': ['A', 'A', 'B', 'C', 'C'],
    'Detail': ['Phase 1', 'Phase 2', 'Initial', 'Planning', 'Execution']  # Note: Projects A and C have multiple phases/details
})
df = pd.merge(user_projects_df, project_details_df, on='ProjectID', how='inner')
df

   UserID ProjectID     Detail
0       1         A    Phase 1
1       1         A    Phase 2
2       2         A    Phase 1
3       2         A    Phase 2
4       1         B    Initial
5       3         B    Initial
6       2         C   Planning
7       2         C  Execution

In [66]:
users_df = pd.DataFrame({
    'UserID': [1, 2, 3],
    'UserName': ['Alice', 'Bob', 'Charlie']
})

emails_df = pd.DataFrame({
    'UserID': [2, 3, 1],
    'Email': ['bob@example.com', 'charlie@example.com', 'alice@example.com']
})

df1= pd.merge(users_df, emails_df, on='UserID')

df1

   UserID UserName                Email
0       1    Alice    alice@example.com
1       2      Bob      bob@example.com
2       3  Charlie  charlie@example.com

In [67]:
employees_df = pd.DataFrame({
    'EmpID': [101, 102, 103],
    'Name': ['Alice', 'Bob', 'Charlie']
})

salaries_df = pd.DataFrame({
    'EmployeeRef': [102, 103, 104],
    'Salary': [70000, 80000, 90000]
})
df2 = pd.merge(employees_df, salaries_df, left_on='EmpID', right_on='EmployeeRef')

df2

   EmpID     Name  EmployeeRef  Salary
0    102      Bob          102   70000
1    103  Charlie          103   80000

In [73]:

import pandas as pd


employee_names_df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David']
}, index=[101, 102, 103, 104])  # Employee IDs as index

employee_salaries_df = pd.DataFrame({
    'Salary': [70000, 80000, 90000, 60000]
}, index=[103, 104, 105, 106])  # Employee IDs as index


employee_salaries_df2 = pd.DataFrame({
    'Salary': [70000, 80000, 90000, 60000]
}, index=[103, 104, 105, 101])



# Perform a left join using indexes
df3 = pd.merge(employee_names_df, employee_salaries_df, left_index=True, right_index=True)

df3

        Name  Salary
103  Charlie   70000
104    David   80000

In [74]:
employee_names_df.join(employee_salaries_df)

        Name   Salary
101    Alice      NaN
102      Bob      NaN
103  Charlie  70000.0
104    David  80000.0

In [76]:
employee_names_df.join(employee_salaries_df2)   #salary df2

        Name   Salary
101    Alice  60000.0
102      Bob      NaN
103  Charlie  70000.0
104    David  80000.0